{
  "title": "Stuck in the snow in the North",
  "content": "<p>You know you 're on a good trip when you can combine a music workshop, time with new friends, and snowy landscapes. This road trip to Derry was a perfect combination of the above. The day started by attending a Greek and Irish bouzouki workshop and learning the basics of string instruments. We then hung out with the folks that organized it and learned a bit about the history and the culture of the \"walled city\" while enjoying some hot coffee in a local cafe. Naturally, the day passed fast, and before we knew it, it was already almost 9pm.<p/><p>We started heading towards Loughmacrory to spend the night. </p><p>We didn't have much clue about the whereabouts of the village and as usual, simply set the location in Google maps and started our trip.  It was February, and the weather was cold. It had snowed, and everything was so peaceful around us. I was happy because the cottage was supposed to have some great views overlooking a lake on top of a hill.</p><p>Now, Google maps have picked some tiny awkward roads in the past, which could be avoided. But then again, no software is perfect, and rural Ireland always has a few of those. That was my excuses for rakishly entering a narrow road, a bit snowed on the side - what can possibly go wrong? </p><p>Well... A few minutes later, the road was getting icier, and I felt losing control of the car. I tried to keep calm, but I wasn't sure what to do and kept going. Soon the front-wheel started spinning like crazy, and the car stopped. Shit. Shit. Shit. I tried to turn the steering wheel and pressed the gas pedal harder, but the wheel was still spinning uncontrollably. We were stuck.</p><p>I looked at Dora; she was as freaked out as me. I switched off the car engine and tried to remain calm. I had no idea where we were, there was no indication of any form of life. The thermometer was showing 2 degrees. I grabbed my phone to call 112. No connection. Of course. </p><p>Are we going to freeze here? How long would the car battery last? I wondered if it could make the night. \"Oh god, I need to pee\". Of course, stress makes you want to pee. I got out of the car and peed in the snow. When I saw the snow melting, it struck me that I should have done this next to the stuck wheel. Too late, pee was wasted. I was a bit calmer, though. I tried to be rational but couldn't see many options. With no cell coverage, all we could do was desperately start walking in the middle of the mountain until we find some form of life and ask for help. Or wait.</p><p>After what looked like ages, while we were trying to figure out ways to keep ourselves warm, lights appeared ahead. A CAR! Oh my god, somebody will save us. I got out of the car and started running towards the other vehicle. A man stopped and looked at me a bit cautiously. </p><p class='centered'>\"Hey, sorry to run onto you like this, but we are stuck. Can you help us?\"</p><p>He looked towards our car stuck on the bush. Then, he looked back at me.</p><p class='centered'>\"I see\".</p><p>He got out of his car and assessed the situation. He then took my keys and fired up the engine. With careful calculations, he turned the wheel and speeded firmly. He did what I unsuccessfully attempted to do earlier, but now it worked: the car moved a bit. He insisted, and a couple of minutes later after bouncing back and forth, we got unstuck. Oh my god, the relief. I thanked him and took charge as he went his way. </p><p>Back to the main road, we called our Airbnb host for help. He wasn't very pleased as we were already quite late for, but gave us the correct directions to stay out of trouble. Almost 2km away from the house, the car almost got stuck again. I stubbornly pressed the gas pedal determined to reach the house, the wheel spun a bit, but passed over the ice and kept going. Dora went crazy \"Oh my god, oh my god, you are the champion, you are the best!\". </p><p>We reached the house a couple of minutes later. A lit fireplace was waiting for us in a cosy warm living room. We prepared some tea, got covered up in blankets and relaxed ourselves to sleep. The next morning we woke up amidst a white snowed mountain, with a beautiful view of a big lake. Happiness. </p>",
  "image": "derry.jpg",
  "date": "28-10-2019"
}