{
  "title": "Sharing a bed in Toronto",
  "image_title": "Photo by Vinayak Sharma on Unsplash",
  "content": "<p>We arrived in Toronto at 6 in the morning after a five-hour flight from San Fransisco. We had pretty much skipped a full night's sleep but were ready to start the day. We wanted to grab the opportunity and spend the weekend in Toronto on our way back to Dublin from a work trip. First stop was the Niagara falls. I was so excited to see the \"8th natural wonder of the world\", and it was my first time visiting any of those. After a two and a half-hour drive, we arrived there just on time for a much needed energizing breakfast.</p><p>Arriving at the falls created such an overwhelming sense of awe to me, I felt my heart almost skip a bit when I saw them. Even using my peripheral vision, I couldn't see the entire view, so I had to turn my head to appreciate it fully. Peter was also astonished.</p><p>We parked the car and spotted some peameal sandwiches in a local deli, which is supposed to be a signature dish of Toronto. We comfortably sat under the trees next to the falls, enjoying the unique view while satisfying our hunger. So hungry, so sleepless, but so present in the moment absorbing the most of it. Listening to the whooshy sound of the water falling was so meditating. Maybe it was the tiredness or the waterfall sound, but I felt my eyes closing and fell asleep laying in the grass.</p><p>We woke up 3 hours later, despite the noise of the tourists around us. It was time to drive back and check-in to our hostel. When we arrived, though, we had an unpleasant surprise. The booking system would only keep our room until 6 pm. Suddenly, we had no accommodation, no mobile internet, and in fairness not much money to rent a new place last minute either. Shit. </p><p>They told us they only had a double room available. Peter and I were colleagues for a while, certainly getting along but also not sleeping in the same bed type of colleagues. Fun. Peter suggested that he could sleep in the bathtub, and I get the bed - truly a gentleman. I couldn't accept this though, so a few hours and a few drinks later we tried to sleep in the same bed.</p><p>Have you ever tried sleeping in the same bed with somebody you don't know well? Sleeping under the trees in the falls was way easier for me. I turned around for hours, and I did all my admin work-related stuff but still wouldn't relax enough. The rest of the days, we spent every waking and sleeping moment together. </p><p>Was it a fun story of a great trip? Absolutely. Did I deep inside wish it would go by fast? Surely as hell. The main thing I learned is that people are great as long as you have the necessary distance from them. And a bed apart is an absolute minimum one.</p>",
  "image": "niagra.jpg",
  "date": "25-10-2019"
}