{
  "title": "Not all those who wander are lost",
  "content": "<p>I have to say: I am not the most organized traveller. I usually book my flights and accommodations and then show up with no preparation or idea of what to do. This practice does leave room for a bit of serendipity, though, which has worked well for me so far. It was no different when I arrived in Vilnius last November for a long weekend getaway. I had been a bit overwhelmed lately and needed some time off my daily routine. </p> <p> I was walking around in the cold, wondering why I kept having this urge to run away from my responsibilities and if other people felt similarly. More importantly, how would I get rid of these thoughts and be a proper adult? Before I got too lost in my thoughts, I noticed a cute coffee shop on the opposite side of the street, which seemed like the perfect place to have some hot chocolate and plan my day. </p> <p> I sat at a table by the window. I opened the touristic guide, which I had grabbed earlier at the airport, and skimmed through it to find the main attractions to visit. \"You won't see the interesting parts of Vilnius with that book you have.\" I heard a male voice next to me. I raised my eyes and looked at the guy at the next table, who continued, \"I can show you around if you want.\" I stayed quiet for a bit. Now, don't get me wrong, I'm all about adventures and the such, but I am still a woman travelling alone and quite sceptical about following random guys around. Also, where did this guy even come from? \"Don't worry; we 'll just walk. I'll show you some local places; no need to go anywhere you feel unsafe,\" he continued as he probably sensed my hesitation. \"My name is Andrius, by the way.\" </p> <p>I've always believed that coffee shops are places where the magic happens and based on the agreement that we would only walk outside, I left my concerns aside and decided to walk with him in the city. He asked me if I knew the Užupis neighbourhood and suggested to go there. It was a place for artists and students, declared as an independent republic within Lithuania where the country laws don't apply. I joked that walking with him in an area where the laws are not in effect might not be the smartest thing to do. </p> <p>The neighbourhood was lovely, though. It even had its own constitution, which, among other things, stated the following: </p> <p class='centered'> \"<i>Everyone has the right to die, but this is not an obligation.</i>\" </p> <p class='centered'>\"<i>Sometimes, everyone has the right to be unaware of their duties.</i>\" <p/> <p>Immortality and freedom. This art republic gave me the promise I was looking for through some mysterious Andrius. I smiled and thought to myself that possibilities were around and that I should just keep searching. Not all those who wander are lost. </p>",
  "image": "vilnius.jpg",
  "date": "30-10-2019"
}